2D/exp3/system/changeTokEpsilon
#!/bin/bash 

mv fvSchemes fvSchemes.omega
mv fvSolution fvSolution.omega
mv fvSchemes.kEpsilon fvSchemes
mv fvSolution.kEpsilon fvSolution
